app/views/programs/show.html.erb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."program_id" = $1  [["program_id", 1]]
---
  <h2> Exercises </h2>
  <% @program.exercises.each do |exercise| %>