app/controllers/exercises_controller.rb

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @program = Program.find(params[:program_id])

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "exercises" ("name", "weight", "reps", "sets", "photo_url", "program_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Squats"], ["weight", 190], ["reps", 5], ["sets", 5], ["photo_url", ""], ["program_id", 1]]
---
  def create
    @program = Program.find(params[:program_id])
    @exercise = @program.exercises.create!(exercise_params)

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @exercise = Exercise.find(params[:id])
    @program = Program.find(params[:program_id])

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "exercises" SET "weight" = $1, "reps" = $2, "sets" = $3 WHERE "exercises"."id" = $4  [["weight", 190], ["reps", 5], ["sets", 5], ["id", 1]]
---
  def update
    @exercise = Exercise.find(params[:id])
    @exercise.update(exercise_params)

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 1]]
---
  def destroy
    @exercise = Exercise.find(params[:id])
    @program = @exercise.program
    @exercise.destroy