app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index

    @programs = Program.all

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @program = Program.find(params[:id])

INSERT INTO "programs" ("name", "details", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "5x5   Monday "], ["details", "Monday lifting"], ["user_id", 10]]
---
  def create
    @program = current_user.programs.create!(program_params)

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @program = Program.find(params[:id])

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "programs" SET "name" = $1, "details" = $2 WHERE "programs"."id" = $3  [["name", "5x5   Monday "], ["details", ""], ["id", 1]]
---
  def update
    @program = Program.find(params[:id])
    if @program.user == current_user
      @program.update(program_params)

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "programs" WHERE "programs"."id" = $1  [["id", 1]]
---
  def destroy
    @program = Program.find(params[:id])
    if @program.user == current_user
      @program.destroy